app/controllers/radio_lists_controller.rb

SELECT "radio_lists".* FROM "radio_lists"
---
  def index
    @radio_lists = RadioList.all

SELECT "radio_lists".* FROM "radio_lists" WHERE "radio_lists"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @radio_list = RadioList.find(params[:id])

SELECT "radio_lists".* FROM "radio_lists" WHERE "radio_lists"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @radio_list = RadioList.find(params[:id])

INSERT INTO "radio_lists" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 11 Dec 2014 21:32:55 UTC +00:00], ["updated_at", Thu, 11 Dec 2014 21:32:55 UTC +00:00]]
---
  def create
    @radio_list = RadioList.new(params[:radio_list])

    respond_to do |format|
      if @radio_list.save

SELECT "radio_lists".* FROM "radio_lists" WHERE "radio_lists"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "radio_lists" SET "radio_url" = 'http://shoutcast.rtl.it:3010/stream/1/', "updated_at" = '2014-12-13 21:31:30.698432' WHERE "radio_lists"."id" = 4
---
  def update
    @radio_list = RadioList.find(params[:id])

    respond_to do |format|
      if @radio_list.update_attributes(params[:radio_list])

SELECT "radio_lists".* FROM "radio_lists" WHERE "radio_lists"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "radio_lists" WHERE "radio_lists"."id" = ?  [["id", 1]]
---
  def destroy
    @radio_list = RadioList.find(params[:id])
    @radio_list.destroy

SELECT "radio_lists".* FROM "radio_lists" WHERE "radio_lists"."id" = ? LIMIT 1  [["id", "2"]]
---
  def play_stream
    if params[:id]
      @radio = RadioList.find(params[:id])